[{"Title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "Preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"Title": "InSight's 'Mole' Team Peers into the Pit", "Preview": "Efforts to save the heat probe continue."}, {"Title": "Mars InSight Lander to Push on Top of the 'Mole'", "Preview": "Engineers have a plan for pushing down on the heat probe, which has been stuck at the Martian surface for a year."}, {"Title": "All About the Laser (and Microphone) Atop Mars 2020, NASA's Next Rover", "Preview": "SuperCam is a rock-vaporizing instrument that will help scientists hunt for Mars fossils."}, {"Title": "What's Mars Solar Conjunction, and Why Does It Matter?", "Preview": "NASA spacecraft at Mars are going to be on their own for a few weeks when the Sun comes between Mars and Earth, interrupting communications."}, {"Title": "How NASA's Perseverance Mars Team Adjusted to Work in the Time of Coronavirus ", "Preview": "Like much of the rest of the world, the Mars rover team is pushing forward with its mission-critical work while putting the health and safety of their colleagues and community first."}, {"Title": "8 Martian Postcards to Celebrate Curiosity's Landing Anniversary", "Preview": "The NASA rover touched down eight years ago, on Aug. 5, 2012, and will soon be joined by a second rover, Perseverance."}, {"Title": "NASA Mars Mission Connects With Bosnian and Herzegovinian Town", "Preview": "A letter from NASA was presented to the mayor of Jezero, Bosnia-Herzegovina, honoring the connection between the town and Jezero Crater, the Mars 2020 rover landing site."}, {"Title": "NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight", "Preview": "Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check."}, {"Title": "While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus", "Preview": "This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars."}, {"Title": "Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest", "Preview": "Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. "}, {"Title": "Media Get a Close-Up of NASA's Mars 2020 Rover", "Preview": "The clean room at NASA's Jet Propulsion Laboratory was open to the media to see NASA's next Mars explorer before it leaves for Florida in preparation for a summertime launch."}, {"Title": "NASA's Curiosity Mars Rover Snaps Its Highest-Resolution Panorama Yet", "Preview": "To go along with the stunning 1.8-billion-pixel image, a new video offers a sweeping view of the Red Planet."}, {"Title": "NASA's Perseverance Rover Will Look at Mars Through These 'Eyes'", "Preview": "A pair of zoomable cameras will help scientists and rover drivers with high-resolution color images."}, {"Title": "NASA's New Mars Rover Will Use X-Rays to Hunt Fossils", "Preview": "PIXL, an instrument on the end of the Perseverance rover's arm, will search for chemical fingerprints left by ancient microbes."}]